Revit 2027 API
ParameterTypeId.RbsPipeOuterDiameter Property
 "Outside Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsPipeOuterDiameter { get; }
Public Shared ReadOnly Property RbsPipeOuterDiameter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsPipeOuterDiameter {
	ForgeTypeId^ get ();
}
static member RbsPipeOuterDiameter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace